In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.DataFrame.from_dict(dict([("A", [1, 2, 3]), ("B", [4, 5, 6])]))

   A  B
0  1  4
1  2  5
2  3  6

In [4]:
pd.DataFrame.from_dict(
    dict([("A", [1, 2, 3]), ("B", [4, 5, 6])]), 
    orient="index", 
    columns=["one", "two", "three"], 
)

   one  two  three
A    1    2      3
B    4    5      6

In [6]:
d = {
    "one":pd.Series([1.0, 2.0, 3.0], index=["a", "b", "c"]), 
    "two":pd.Series([1.0, 2.0, 3.0, 4.0], index=["a", "b", "c", "d"])
}

In [7]:
df = pd.DataFrame(d)

In [8]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [9]:
df["one"]

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [10]:
df["three"] = df["one"] * df["two"]

In [11]:
df["flag"] = df["one"] > 2

In [12]:
df

   one  two  three   flag
a  1.0  1.0    1.0  False
b  2.0  2.0    4.0  False
c  3.0  3.0    9.0   True
d  NaN  4.0    NaN  False

In [13]:
del df["two"]

In [14]:
df

   one  three   flag
a  1.0    1.0  False
b  2.0    4.0  False
c  3.0    9.0   True
d  NaN    NaN  False

In [15]:
three = df.pop("three")

In [16]:
three

a    1.0
b    4.0
c    9.0
d    NaN
Name: three, dtype: float64

In [17]:
df

   one   flag
a  1.0  False
b  2.0  False
c  3.0   True
d  NaN  False

In [18]:
df["foo"] = "bar"

In [19]:
df

   one   flag  foo
a  1.0  False  bar
b  2.0  False  bar
c  3.0   True  bar
d  NaN  False  bar

In [20]:
df["one_trunc"] = df["one"][:2]

In [21]:
df

   one   flag  foo  one_trunc
a  1.0  False  bar        1.0
b  2.0  False  bar        2.0
c  3.0   True  bar        NaN
d  NaN  False  bar        NaN

In [22]:
df.insert(1, "bar", df["one"])

In [23]:
df

   one  bar   flag  foo  one_trunc
a  1.0  1.0  False  bar        1.0
b  2.0  2.0  False  bar        2.0
c  3.0  3.0   True  bar        NaN
d  NaN  NaN  False  bar        NaN